In [1]:
#IMPORTS
import mysql.connector as sql
import pandas as pd

In [2]:
#CREATE CONNECTION
db_connection = sql.connect(host='localhost', database='pandas-db', user='root', password='')

In [3]:
#SET CURSOR TO THAT DATABASE
db_cursor = db_connection.cursor()

In [4]:
#Using SQL Query to convert to a dataframe
df = pd.read_sql('SELECT * FROM datascience', con=db_connection)

In [5]:
df

   Serial    Name       Job  Age
0       1  Nayeem  Engineer   24
1       3   Afrin   Student   14
2       4  Shanta    Doctor   50
3       5   Munir   Service   56

In [6]:
#Save to a csv file
#df.to_csv('db-table-datascience.csv')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Serial  4 non-null      int64
 1   Name    4 non-null      object
 2   Job     4 non-null      object
 3   Age     4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [21]:
#Edit dataframe
#df['Height(m)'] = [1.9,1.65,1.6,1.75]
df.loc[3]

Serial          5
Name        Munir
Job       Service
Age            56
Name: 3, dtype: object

In [26]:
#ADDING NEW ROW OF DATA
df2 = pd.DataFrame({'Serial' : [6], 'Name' : ['Tamjid'], 'Job' : ['Chutiya'], 'Age' : [26]})

   Serial    Name      Job  Age
0       6  Tamjid  Chutiya   26

In [27]:
df = pd.concat([df,df2])

In [28]:
df

   Serial    Name       Job  Age
0       1  Nayeem  Engineer   24
1       3   Afrin   Student   14
2       4  Shanta    Doctor   50
3       5   Munir   Service   56
0       6  Tamjid   Chutiya   26

In [49]:
#ADDING NEW COLUMS OF DATA
'''
Inorder to add a new column the table must be configured in the mySQL database manually to add a new column
'''

In [40]:
#df['Height(m)'] = [1.9,1.65,1.6,1.75,1.65] 
#ADD COLUMN WHEN CONFIGURE IN THE DATABASE

In [ ]:
#WRITING BACK TO THE MYSQL DATABASE

In [38]:
#IMPORT THE SQLALCHEMY ENGINE TO WRITE
from sqlalchemy import create_engine

In [ ]:
#CREATE ENGINE INSTANCE WHERE 'mysql+mysqlconnector://[username]:[password]@[host]/[database-name]'
engine = create_engine('mysql+mysqlconnector://root:@localhost/pandas-db', echo=False)

In [47]:
df.to_sql(con=engine, name='datascience', if_exists='replace',index=False)